Revit 2027 API
AdvancedLayered Properties
The AdvancedLayered type exposes the following members.
Properties
Name | Description
LayeredAnisotropy |  The property labeled "Anisotropy" from the "AdvancedLayered" schema.
LayeredBottomF0 |  The property labeled "Color" from the "AdvancedLayered" schema.
LayeredDiffuse |  The property labeled "Color" from the "AdvancedLayered" schema.
LayeredF0 |  The property labeled "Clearcoat reflectance" from the "AdvancedLayered" schema.
LayeredFraction |  The property labeled "Fraction" from the "AdvancedLayered" schema.
LayeredNdfType |  The property labeled "NDF" from the "AdvancedLayered" schema.
LayeredNormal |  The property labeled "Image" from the "AdvancedLayered" schema.
LayeredRotation |  The property labeled "Rotation" from the "AdvancedLayered" schema.
LayeredRoughness |  The property labeled "Roughness" from the "AdvancedLayered" schema.
SurfaceAlbedo |  The property labeled "Color" from the "AdvancedLayered" schema.
SurfaceAnisotropy |  The property labeled "Anisotropy" from the "AdvancedLayered" schema.
SurfaceCutout |  The property labeled "Image" from the "AdvancedLayered" schema.
SurfaceNdfType |  The property labeled "NDF" from the "AdvancedLayered" schema.
SurfaceNormal |  The property labeled "Image" from the "AdvancedLayered" schema.
SurfaceRotation |  The property labeled "Rotation" from the "AdvancedLayered" schema.
SurfaceRoughness |  The property labeled "Roughness" from the "AdvancedLayered" schema.
Top
See Also
Reference
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace